from ntpath import join
import re

text = "충청북도 청주시 청원구 대성로 298 석우빌 305동101호 충청남도 아산시 온천대로 762-1 메인하우스 205호 서울특별시 서초구 반포대로23길 가로90cm세로40 충청남도 태안군 남면 석돌길 100 서울특별시 종로구 세종대로 209 전라남도 순천시 기적의도서관2길 51 b동 1605호 충청남도 청주시 762-1 하우스" 
#print(text) 

mobile = re.findall(r'([\+\(]?[0-9][0-9 .\-\(\)]{8,}[0-9])', text)
email = re.findall(r"[\w!#$%&'*+/=?^_{|}~-]+(?:\.[\w!#$%&'*+/=?^_{|}~-]+)*@(?:\w+\.)+\w+",text)
all = re.findall(r"[가-힣0-9a-zA-Z\-\*]+",text)
#addr = re.findall(r"(?:[가-힣]+[시도]\s)(?:[가-힣]+[시군구]\s)+(?:[가-힣]+[읍면동]\s)?(?:[가-힣\d]+[로길]\s)?(?:\d+)?(?:-\d+)?",text)
addr = re.findall(r"(?:[가-힣]+[시도]\s)(?:[가-힣]+[시군구]\s)+(?:[가-힣]+[읍면동]\s)?(?:[가-힣\d]+[로길]\s)?\d*(?:-\d+)?(?:\s[가-힣]+)?(?:\s\w+동)?(?:\s\d+호)?",text)
#addr2 = re.findall(r"(?:[가-힣]+[시도]\s)(?:[가-힣]+[시군구]\s)(?:[가-힣]+[읍면동]\s)?(?:[가-힣\d]+[로길]\s)?(?:\d+)?(?:-)?(?:\d+)?(?:\s[가-힣]+)?(?:\s\d+동)?(?:\s\d+호)?",text)
#addr2 = re.findall(r"([가-힣]+(시|도)|[서울]|[인천]|[대구]|[광주]|[부산]|[울산])( |)[가-힣]+(시|군|구))",text)

# print(mobile)
#print(email)
print(all)
text2 = ' '.join(all)
print(text2)
#ans = re.findall(r"^(?:[가-힣]+[시도]\s)(?:[가-힣]+[시군구]\s)+(?:[가-힣]+[읍면동]\s)?(?:[가-힣\d]+[로길]\s)?\d*(?:-\d+)?(?:\s[가-힣]+\s)?(?:\d+동\s)?(?:\d+호)?",text2)
# ans = re.findall(r"(?:[가-힣\w\d]+동)-(?:[가-힣\w\d]+호)",text2)
ans = re.findall(r"(?:([가-힣\w\d]+)동)(?:\s+)?(?:([가-힣\w\d]+)호)",text2)
print(ans)
print(ans[0][0] + '-'+ ans[0][1])
#print(addr2)



